[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:9:29
         public string Play(int upperBound)
         {
             string finalOutput = string.Empty;
-            for (int i = 1; i <= upperBound; i++)
+            for (int i = 1; i > upperBound; i++)
             {
                 string localOutput = i % 3 == 0 ?

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:9:29
         public string Play(int upperBound)
         {
             string finalOutput = string.Empty;
-            for (int i = 1; i <= upperBound; i++)
+            for (int i = 1; i < upperBound; i++)
             {
                 string localOutput = i % 3 == 0 ?

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:11:38
             string finalOutput = string.Empty;
             for (int i = 1; i <= upperBound; i++)
             {
-                string localOutput = i % 3 == 0 ?
+                string localOutput = i % 3 != 0  ?
                     "Fizz" :
                     string.Empty;

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:11:38
             string finalOutput = string.Empty;
             for (int i = 1; i <= upperBound; i++)
             {
-                string localOutput = i % 3 == 0 ?
+                string localOutput = i * 3  == 0 ?
                     "Fizz" :
                     string.Empty;

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:14:32
                 string localOutput = i % 3 == 0 ?
                     "Fizz" :
                     string.Empty;
-                localOutput += i % 5 == 0 ?
+                localOutput += i * 5  == 0 ?
                     "Buzz" :
                     string.Empty;

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:14:32
                 string localOutput = i % 3 == 0 ?
                     "Fizz" :
                     string.Empty;
-                localOutput += i % 5 == 0 ?
+                localOutput += i % 5 != 0  ?
                     "Buzz" :
                     string.Empty;

[Killed] Binary expression mutation
FizzBuzz.Impl/FizzBuzzService.cs:17:32
                 localOutput += i % 5 == 0 ?
                     "Buzz" :
                     string.Empty;
-                localOutput += localOutput == string.Empty ?
+                localOutput += localOutput != string.Empty  ?
                     i.ToString() :
                     string.Empty;
